
## :x: Apply Failed

[CI link](https://github.com/goda6565/lambda-bot/actions/runs/15224142451)



It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
module.lambda.data.aws_iam_policy_document.lambda_policy_document: Reading...
module.api_gateway.aws_cloudwatch_log_group.api_gateway: Refreshing state... [id=/aws/lambda/lambda-bot-prod-api-gateway]
module.api_gateway.aws_apigatewayv2_api.lambda_api: Refreshing state... [id=0pdgg6nqu1]
module.lambda.aws_cloudwatch_log_group.lambda: Refreshing state... [id=/aws/lambda/lambda-bot-prod]
module.ecr.aws_ecr_repository.ecr_repository: Refreshing state... [id=lambda-bot-prod]
module.lambda.data.aws_iam_policy_document.lambda_policy_document: Read complete after 0s [id=2690255455]
module.lambda.aws_iam_role.lambda_role: Refreshing state... [id=lambda-bot-prod-role]
module.lambda.aws_iam_role_policy_attachment.lambda_role_policy_attachment: Refreshing state... [id=lambda-bot-prod-role-20250524055713202500000001]
module.api_gateway.aws_apigatewayv2_stage.lambda_function_invoke_stage: Refreshing state... [id=$default]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.api_gateway.aws_apigatewayv2_integration.lambda_integration will be created
  + resource "aws_apigatewayv2_integration" "lambda_integration" {
      + api_id                                    = "0pdgg6nqu1"
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "2.0"
      + timeout_milliseconds                      = 30000
    }

  # module.api_gateway.aws_apigatewayv2_route.lambda_function_route will be created
  + resource "aws_apigatewayv2_route" "lambda_function_route" {
      + api_id             = "0pdgg6nqu1"
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "POST /invoke"
      + target             = (known after apply)
    }

  # module.api_gateway.aws_lambda_permission.allow_apigateway will be created
  + resource "aws_lambda_permission" "allow_apigateway" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "lambda-bot-prod"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + qualifier           = "prod"
      + source_arn          = "arn:aws:execute-api:ap-northeast-1:061051222129:0pdgg6nqu1/*/*"
      + statement_id        = "AllowInvokeFromApiGateway"
      + statement_id_prefix = (known after apply)
    }

  # module.lambda.aws_lambda_alias.lambda will be created
  + resource "aws_lambda_alias" "lambda" {
      + arn              = (known after apply)
      + function_name    = "lambda-bot-prod"
      + function_version = (known after apply)
      + id               = (known after apply)
      + invoke_arn       = (known after apply)
      + name             = "prod"
    }

  # module.lambda.aws_lambda_function.lambda will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = [
          + "arm64",
        ]
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "lambda-bot-prod"
      + id                             = (known after apply)
      + image_uri                      = "public.ecr.aws/lambda/provided:al2"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Image"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::061051222129:role/lambda-bot-prod-role"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Name" = "lambda-bot-prod"
        }
      + tags_all                       = {
          + "Name" = "lambda-bot-prod"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ENV" = "prod"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config {
          + mode = "Active"
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.
module.lambda.aws_lambda_function.lambda: Creating...
╷
│ Error: creating Lambda Function (lambda-bot-prod): operation error Lambda: CreateFunction, https response error StatusCode: 400, RequestID: 6c8b1af6-5b19-43a4-be9c-0021a7a3d05a, InvalidParameterValueException: Source image public.ecr.aws/lambda/provided:al2 is not valid. Provide a valid source image.
│ 
│   with module.lambda.aws_lambda_function.lambda,
│   on ../../modules/lambda/aws_lambda_function.tf line 1, in resource "aws_lambda_function" "lambda":
│    1: resource "aws_lambda_function" "lambda" {
│ 
╵
::error::Terraform exited with code 1.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":3,"Program":"tfcmt","SHA1":"46bfe526ee5809c7a89cd75a4949acb65d2be468","Vars":{},"WorkflowName":"Terraform Multi-Env CI"} -->